In [2]:
import pandas as pd
import numpy as np

In [3]:
labels = ['a','b','c','d','e']
data = [1,2,3,4,5]

In [4]:
arr = np.array(data)

In [5]:
arr

array([1, 2, 3, 4, 5])

In [10]:
type(data)

list

In [11]:
s = pd.Series(data)

In [12]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [13]:
type(s)

pandas.core.series.Series

In [14]:
s2 = pd.Series(data, labels)

In [16]:
s2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [32]:
s3 = pd.Series(['Apple', 'Cherry', 'Kiwi'], ['f1','f2','f3'])

In [33]:
s3

f1     Apple
f2    Cherry
f3      Kiwi
dtype: object

In [35]:
#list
l1 = [[1,2,3],[11,22,33],[111,222,333]]

In [39]:
l1

[[1, 2, 3], [11, 22, 33], [111, 222, 333]]

In [40]:
type(l1)l1

list

In [37]:
l1_array = np.array(l1)

In [41]:
type(l1)

list

In [42]:
l1_df = pd.DataFrame(l1)

In [43]:
l1_df

     0    1    2
0    1    2    3
1   11   22   33
2  111  222  333

In [44]:
type(l1_df)

pandas.core.frame.DataFrame

In [47]:
df_1 = pd.DataFrame(l1, ['a','b','c'], columns = ['i','ii','iii'])

In [51]:
df_1

     i   ii  iii
a    1    2    3
b   11   22   33
c  111  222  333

In [54]:
df_1['i']['c']

111

In [58]:
df_i = df_1.i

In [59]:
df_i

a      1
b     11
c    111
Name: i, dtype: int64

In [69]:
# Adding series
s1 = pd.Series([10,20,30], index=['a','b','c'])
s2 = pd.Series([10,-20,30], index=['a', 'c', 'e'])
sum1 = s1 + s2
sum1

a    20.0
b     NaN
c    10.0
e     NaN
dtype: float64

In [72]:
sum2 = s1.add(s2, fill_value=0)
sum2

a    20.0
b    20.0
c    10.0
e    30.0
dtype: float64

In [79]:
s1[~(s1 < 16)]

b    20
c    30
dtype: int64

In [82]:
s1[(s1>1) | (s1<20)]

a    10
b    20
c    30
dtype: int64

In [85]:
df_2 = pd.DataFrame(l1, ['a','b','c'], columns = ['x','y','z'])
df_2

     x    y    z
a    1    2    3
b   11   22   33
c  111  222  333

In [91]:
df_2.iloc[[1],[2]]

    z
b  33

In [93]:
df_2.iloc[1,2]

33

In [94]:
df_2.iloc[[1,2]]

     x    y    z
b   11   22   33
c  111  222  333

In [95]:
df_2.iat[1,2]

33

In [97]:
df_2.at['a','x']

1

In [98]:
df_2.loc['a','x']

1

In [108]:
df_2.ix[2]

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

x    111
y    222
z    333
Name: c, dtype: int64

In [106]:
df_2.shape

(3, 3)

In [125]:
df_2.iloc[[0,1],[1,2]]

    y   z
a   2   3
b  22  33

In [130]:
df_2.columns

Index(['x', 'y', 'z'], dtype='object')

In [131]:
df_2.index

Index(['a', 'b', 'c'], dtype='object')

In [132]:
df_2.info

<bound method DataFrame.info of      x    y    z
a    1    2    3
b   11   22   33
c  111  222  333>

In [133]:
df_2.sort_index()

     x    y    z
a    1    2    3
b   11   22   33
c  111  222  333

In [134]:
df_2.sort_values(by = 'y')

     x    y    z
a    1    2    3
b   11   22   33
c  111  222  333

In [138]:
l2 = [[2,1,3],[22,11,33],[333,111,222]]
df_3 = pd.DataFrame(l2, ['b','a','c'], columns = ['x','y','z'])
df_3

     x    y    z
b    2    1    3
a   22   11   33
c  333  111  222

In [139]:
df_3.sort_index()

     x    y    z
a   22   11   33
b    2    1    3
c  333  111  222

In [145]:
df_3.sort_values(by = 'z')

     x    y    z
b    2    1    3
a   22   11   33
c  333  111  222

In [148]:
df_3

     x    y    z
b    2    1    3
a   22   11   33
c  333  111  222

In [149]:
df_3.rank()

     x    y    z
b  1.0  1.0  1.0
a  2.0  2.0  2.0
c  3.0  3.0  3.0

In [154]:
df_3.drop(['a'], axis = 0)

     x    y    z
b    2    1    3
c  333  111  222

In [155]:
df_3

     x    y    z
b    2    1    3
a   22   11   33
c  333  111  222

In [159]:
func = lambda x:x*2
df_3.apply(func)

     x    y    z
b    4    2    6
a   44   22   66
c  666  222  444

In [161]:
df_3.applymap(func)

     x    y    z
b    4    2    6
a   44   22   66
c  666  222  444

In [168]:
l2 = [[2,1,3],[3,4,5],[2,7,6]]
df_3 = pd.DataFrame(l2, ['b','a','c'], columns = ['x','y','z'])
df_3

   x  y  z
b  2  1  3
a  3  4  5
c  2  7  6

In [169]:
df_3.sum()

x     7
y    12
z    14
dtype: int64

In [171]:
df_3.sum(axis=1)

b     6
a    12
c    15
dtype: int64

In [173]:
df_3.cumsum()

   x   y   z
b  2   1   3
a  5   5   8
c  7  12  14

In [174]:
df_3.min()

x    2
y    1
z    3
dtype: int64

In [175]:
df_3.max()

x    3
y    7
z    6
dtype: int64

In [184]:
df_3.idxmin()

x    b
y    b
z    b
dtype: object

In [177]:
df_3.idxmax()

x    a
y    c
z    c
dtype: object

In [179]:
df_3.describe()

              x    y         z
count  3.000000  3.0  3.000000
mean   2.333333  4.0  4.666667
std    0.577350  3.0  1.527525
min    2.000000  1.0  3.000000
25%    2.000000  2.5  4.000000
50%    2.000000  4.0  5.000000
75%    2.500000  5.5  5.500000
max    3.000000  7.0  6.000000